/******************************************************************************
FILE:			$Archive: /Delta/ActiveX/FieldMax2/FieldMax2Lib/APA/FieldMax2Lib.h $
AUTHOR:			$Author: Spethj $
REVISION:		$Revision: 19 $

DESCRIPTION:	The header file that exposes the DLL public functions.

HISTORY:		$Log: /Delta/ActiveX/FieldMax2/FieldMax2Lib/APA/FieldMax2Lib.h $
 * 
 * 19    10/04/06 8:05a Spethj
 * Added the serial number write API function
 *
 * 16    8/26/05 12:35p Spethj
 *
 * 15    7/26/05 11:29a Spethj
 * Added the double precision version of get-instrument-state
 *
 * 11    7/13/05 2:40p Spethj
 * Further improvement of device status
 *
 * 8     6/15/05 12:45p Spethj
 * Removed USB descriptor function and structure
 *
 * 2     5/04/05 8:51a Spethj
 * Added the probe type enum
 *
 * 1     4/27/05 9:34a Spethj
 *
 * 1     12/21/04 8:18a Spethj
******************************************************************************/

#ifndef _FIELDMAX2LIB_H
#define	_FIELDMAX2LIB_H

// The following ifdef block is the standard way of creating macros which make exporting
// from a DLL simpler. All files within this DLL are compiled with the FIELDMAX2LIB_EXPORTS
// symbol defined on the command line. this symbol should not be defined on any project
// that uses this DLL. This way any other project whose source files include this file see
// FIELDMAX2LIB_API functions as being imported from a DLL, wheras this DLL sees symbols
// defined with this macro as being exported.
#ifdef FIELDMAX2LIB_EXPORTS
	#define FIELDMAX2LIB_API extern "C" __declspec(dllexport)
#else
	#define FIELDMAX2LIB_API extern "C" __declspec(dllimport)
#endif

#define	MAX_USB_CONNECTIONS					127

typedef unsigned char	VB_BYTE;
typedef short			VB_INTEGER;
typedef int				VB_LONG;
typedef unsigned short	VB_BOOLEAN;
typedef char *			VB_STRING;
typedef float			VB_SINGLE;
typedef double			VB_DOUBLE;

#define	VB_TRUE			-1
#define	VB_FALSE		0

//
// Fieldmax status change structure definition
//
typedef struct
{
	VB_INTEGER index;
	VB_INTEGER position;
	VB_BOOLEAN present;
} StatusChangeType;

/****************************************************************************
	VB declaration:

	Private Type StatusChangeType
	    index As Integer
	    position As Integer
	    present As Boolean
	End Type
****************************************************************************/

//
// Fieldmax data packet structure definition
//

typedef struct
{
	union
	{
		VB_SINGLE value;
		VB_LONG dw;
	} measure;
	VB_LONG period;
} DataPacketType;

/****************************************************************************
	VB declaration:

	Private Type DataPacketType
	    value As Single
	    period As Long
	End Type
****************************************************************************/

//
// Fieldmax instrument state structure definition using single precision floats
//
typedef struct
{
	VB_INTEGER probeType;							// 0
	VB_INTEGER meterType;							// 2
	VB_INTEGER lastFault;							// 4
	VB_INTEGER statisticsMode;						// 6
	VB_INTEGER batchRestartMode;					// 8
	VB_INTEGER fill1;								// 10
	VB_LONG batchSizeSeconds;						// 12
	VB_LONG batchSizePulses;						// 16
	VB_LONG wavelength;								// 20
	VB_LONG minWavelength;							// 24
	VB_LONG maxWavelength;							// 28
	VB_BOOLEAN areaCorrectionEnabled;				// 32
	VB_INTEGER fill2;								// 34
	VB_SINGLE areaCorrectionDiameter;				// 36
	VB_BOOLEAN averageModeEnabled;					// 40
	VB_INTEGER averageWindowSizeSeconds;			// 42
	VB_INTEGER averageWindowSizePulses;				// 44
	VB_BOOLEAN attenuationCorrectionModeEnabled;	// 46
	VB_SINGLE attenuationCorrectionFactor;			// 48
	VB_INTEGER triggerLevel;						// 52
	VB_INTEGER measurementMode;						// 54
	VB_BOOLEAN autoRangingEnabled;					// 56
	VB_INTEGER fill3;								// 58
	VB_SINGLE range;								// 60
	VB_SINGLE minRange;								// 64
	VB_SINGLE maxRange;								// 68
	VB_BOOLEAN speedupDigitalDisplay;				// 72
	VB_BOOLEAN speedupHostData;						// 74
	VB_BOOLEAN speedupAnalogOutput;					// 76
	VB_BOOLEAN speedupMeter;						// 78
	VB_INTEGER analogOutFullscaleVoltage;			// 80
	VB_BOOLEAN powerState;							// 82
	VB_BOOLEAN backlight;							// 84
	VB_BOOLEAN hertzMode;							// 86
	VB_BOOLEAN holdMode;							// 88
} InstrumentStateType;

//
// Fieldmax instrument state structure definition using double precision floats
//
typedef struct
{
	VB_INTEGER probeType;							// 0
	VB_INTEGER meterType;							// 2
	VB_INTEGER lastFault;							// 4
	VB_INTEGER statisticsMode;						// 6
	VB_INTEGER batchRestartMode;					// 8
	VB_INTEGER fill1;								// 10
	VB_LONG batchSizeSeconds;						// 12
	VB_LONG batchSizePulses;						// 16
	VB_LONG wavelength;								// 20
	VB_LONG minWavelength;							// 24
	VB_LONG maxWavelength;							// 28
	VB_BOOLEAN areaCorrectionEnabled;				// 32
	VB_INTEGER fill2;								// 34
	VB_DOUBLE areaCorrectionDiameter;				// 36
	VB_BOOLEAN averageModeEnabled;					// 44
	VB_INTEGER averageWindowSizeSeconds;			// 46
	VB_INTEGER averageWindowSizePulses;				// 48
	VB_BOOLEAN attenuationCorrectionModeEnabled;	// 50
	VB_DOUBLE attenuationCorrectionFactor;			// 52
	VB_INTEGER triggerLevel;						// 60
	VB_INTEGER measurementMode;						// 62
	VB_BOOLEAN autoRangingEnabled;					// 64
	VB_INTEGER fill3;								// 66
	VB_DOUBLE range;								// 68
	VB_DOUBLE minRange;								// 76
	VB_DOUBLE maxRange;								// 84
	VB_BOOLEAN speedupDigitalDisplay;				// 92
	VB_BOOLEAN speedupHostData;						// 94
	VB_BOOLEAN speedupAnalogOutput;					// 96
	VB_BOOLEAN speedupMeter;						// 98
	VB_INTEGER analogOutFullscaleVoltage;			// 100
	VB_BOOLEAN powerState;							// 102
	VB_BOOLEAN backlight;							// 104
	VB_BOOLEAN hertzMode;							// 106
	VB_BOOLEAN holdMode;							// 108
} InstrumentStateType2;

// VB_INTEGER probeType enumerated values
enum
{
	ptNone = 0,
	ptThermopile = 1,
	ptPyroelectric = 2,
	ptOptical = 3
};

// VB_INTEGER meterType enumerated values
enum
{
	mtNone = 0,
	mtTOP = 1,
	mtTO = 2,
	mtP = 3
};

// VB_INTEGER statisticsMode enumerated values
enum
{
	smNone = 0,
	smOff = 1,
	smMax = 2,
	smMin = 3,
	smMean = 4,
	smStdv = 5
};

// VB_INTEGER batchRestartMode enumerated values
enum
{
	brmNone = 0,
	brmManual = 1,
	brmAuto = 2
};

// VB_INTEGER measurementMode enumerated values
enum
{
	mmNone = 0,
	mmJoules = 1,
	mmWatts = 2
};

// VB_INTEGER analogOutFullscaleVoltage enumerated values
enum
{
	aofvNone = 0,
	aofv1V = 1,
	aofv2V = 2,
	aofv5V = 3
};

/****************************************************************************
	VB declaration:

	Private Type InstrumentStateType
		probeType As Integer
		meterType As Integer
		lastFault As Integer
